#5
# my_str = "qwertyqwertyqwerty"
# my_list = []
# my_set = set(my_str)
# my_list.append(my_set)
# my_list = list(my_set)
# print(my_list)
#############################
#8
# my_person = {"Фамилия": "Винничук",
#              "Имя": "Наталия",
#              "Возраст": "27",
#              "Проживание": {"Страна": "Украина",
#                             "Город": "Днепр",
#                             "Улица": "Паникахи"},
#              "Работа": {"Наличие": "Имеется",
#                         "Должность": "Админ"}}
# print(my_person)

##############################
#9
recipe = {"Коржи": {"Мука": 500,
                    "Молоко": 200,
                    "Масло": 50,
                    "Яйцо": 100},
           "Крем": {"Сахар": 100,
                    "Масло": 50,
                    "Ванииль": 10,
                    "Сметана": 500},
        "Глазурь": {"Какао": 50,
                    "Сахар": 100,
                    "Масло": 100}}
print(recipe)
##############################






